~~~****JIT CCNA Notes****~~~

Have fun!


----------------------------------------------------------------------------------------------------
*** Useful Commands ***
SW1(config)#no ip domain lookup
SW1(config)#host name "SW1"
SW1(config)#default interface gigabitEtherenet0/0/0
SW1(config)#default interface range fa0/1 - 10

SW1#show interfaces status
SW1#show lldp neighbors
SW1#show interfaces status disabled

--Use the "do" command to execute show from any mode-

----------------------------------------------------------------------------------------------------
*** Router Show Commands ***
R1# sh ip int brief --> Show all interfaces and status on a Router
R1# show ip route --> Shows all ip routes on a router
R1# show run --> Shows the running config. Press <enter> for more
R1#default interface [interface-number]

*** Route Config Commands ***

R1(config-if)#ip address XXX.XXX.XXX.XXX xxx.xxx.xxx.xxx.xxx -> Confg IP address
R1(config)# ip route "desitnation" "subnet" "next hop address" -> Add route
R1(config)#no ip route 1.1.1.1 255.255.255.255 2.2.2.2 -> Delete ip route

R1(config)#ip route 0.0.0.0 0.0.0.0 192.168.5.49 -> Default route to internet

----------------------------------------------------------------------------------------------------
***VLAN Commands - Switchport***
SW1(config)#interface range g1/0 - 3
SW1(config-if-range)#switchport mode access
SW1(config-if-range)#switchport access vlan 10

SW1(config)#do show vlan brief

SW1(config)#vlan 20
SW1(config-vlan)#name Sales

*** VLAN Commands - Trunkport ***
SW1(config-if)#switchport mode trunk
SW1(config-if)#switchport trunk encapsulation dot1q
SW1(config-if)#switchport trunk allowed vlan vlan-id1, vlan-id2, ...
SW1(config-if)#do show interfaces trunk

----------------------------------------------------------------------------------------------------
***Sub Interface Commands - ROAS***
- Needed for routing between vlan's on devices that are only Level 2 aware
R1(config)#interface FastEthernet0/1
R1(config-if)#no ip address

R1(config-if)#no shutdown

R1(config)#interface FastEthernet0/1.1
R1(config-if)#encapsulation dot1Q "vlan-id"
R1(config-if)#ip address x.x.y.y < subnet mask >

R1(config-if)#interface FastEthernet0/1.2
R1(config-if)#encapsulation dot1Q 20
R1(config-if)#ip address x.x.y.y < subnet mask >

-----------------------------------------------------------------------------------------------------
*** Layer 3 Switching ***
SW1(config)#ip routing
SW1(config-if)#no switchport
SW1(config)#interface vlan "vlan-id"
SW1(config-if)#ip address x.x.y.y < subnet mask > (DG)

----------------------------------------------------------------------------------------------------
Day 21
*** STP Commands ***
SW1#show spanning-tree
SW1#show spanning-tree active
SW1#show spanning-tree summary
SW1#show spanning-tree vlan 1
SW1#show spanning-tree interface fa0/1
SW1#show spanning-tree interface fa0/1 detail

- Cisco switches operate in STP by default
- STP is set on timers for BPDUs
- STP States blocking, listening, learning, fowarding

SW1(config)#spanning-tree mode ?
pvst        Per-Vlan spanning tree mode
rapid-pvst  Per-Vlan rapid spanning tree mode
- Can set the modes

SW1(config)#spanning-tree vlan 1 root primary
SW1(config)#do show spanning-tree
- Sets the primray root bridge
- If another switches has a lower priority, 
sets the target switch to 4096 less

SW1(config)#spaning-tree vlan 1 priority 32768
- Manually sets the priority of the switch
- Set to 0 to make it the root bridge

SW1(config)#spanning-tree vlan 1 root secondary
SW1(confg)#do show spanning-tree
- Sets the secondary root bridge. "Backup?"

- STP Load-Balancing creates diffrenet STP topolgies for diffrenet vlan
- Configure diffrenet root bridges for diffrenet vlans to load balance


***STP Port Settings***
SW1(config-if)#spaning tree vlan 1 priority ?
cost-Change an interface's per VLAN spanning tree path cost
post-priority Change an interface's spanning tree port priority
- Changing the cost or priority allows you to change STP outcome

SW1(config-if)#spaning tree vlan 1 cost 200
SW1(config-if)#spaning tree vlan 1 port-priority 32


*** Portfast ***
SW1(config-if)#interface g0/2
SW1(config-if)#spanning-tree portfast
SW1(config-if)#switchport mode access
- Portfast should only be used on ports connected to end hosts
- By passes learning and listenign states and goes straight to fowarding
- Switch ports need to be in access mode
- Risk of causing Layer 2 loops if not careful with portast
- Portfast is default in edge mode. Portfast network is an option, but not common

SW1(config-if)#spanning-tree portfast default
- Defaults all access ports to portfast

SW1(config-if)#spaning-tree portfast trunk
- Portfast can be enable on trunk ports in specific situations such as ROAS, but it's not common


***BPDU Gaurd/Filter***
SW1(config-if)#interface g0/2
SW1(config-if)#spanning-tree bpduguard enable
- Cuases an interface that receives BPDUs from another switch to shut down. Prevents loops.
- Prevents Layer 2 loops from forming

SW1(config)#spanning-tree portfast bpduguard default
- Default BPDU Guard on portfast interfaces

SW1#show errdisabled recovery
- Shows a list of root causes for errdisabled. BPDU guard is the most common

SW1#show errdisabled recovery cause bpduguard
- enable errdisabled recovery for ports disabled by a particular cause. bpdu in this case

SW1(config-if)#spaning-tree bpdufilter enable
- BPDU Filter stops a port from sending BPDUs. End hosts don't need to recieve BPDUs.
- Security and performance concerns, although high level.
- Disables STP on the port. Can cause permanent layer 2 loops so becareful!

SW1(config)#spaning-tree portfast bpdufilter default
- Only activates BPDU filter on portfast ports. The port will not send BPDUs
- Best of both worlds. If the port recieves a BPDU, both portfast and filter are disabled. Will operate as an STP port
- Recommened


***Root Guard Notes***
- Prevents a port from becoming a root port if it receives a superior BPDU
- Ensure that the root bridge remians in your LAN, configure Root Guard on
the ports that connect to switches outside of your control
- If a Root Guard enabled port receives a BPDU, it well enter Broken state
and errdisabled. 
- To resolve issue, the port must stop recieving BPDUs
- Ports automatically re-enabled if issue is resolved (IE the suspect switch increase it's priority)
    - Superior BDPUs need to be stopped


***Root Guard Commands***
SW1(config-if)#spanning-tree guard root
- Enables root guard on the interface


***Loop Guard Notes***
- Protects the network from loops by disabling a port if it unexpectedly stops receiving BPDUs
- Ensures the port does not mistkakenly enter the Forwarding state
- Used a lot when unidirectional links occur. Error where transmition only occurs in one direction.
    - Occurs when devices fail to detect physical problems in the fiber. Still reads up/up
- Loop Guard is meant to prevent Non-Designated ports from becoming Designated Ports.
- Loop Guard and Root Guard are mutually exclusive


***Loop Guard Commands***
SW1(config-if)#spanning-tree guard loop
- Enable loop guard on single port

SW1(config)#spanning-tree guard loopguard default
- Enables loop guard on all ports
- Should be enalbed on Root and Non-Designated ports 
- IE Ports that are supposed to receive BPDUs

SW1(config-if)#spanning-tree guard none
- Disables loop guard on specific port 

----------------------------------------------------------------------------------------------------
Day 22 - Rapid STP



----------------------------------------------------------------------------------------------------
Day 23 - EtherChannel

SW1#show etherchannel summary
- Shows info about all etherchannels configured on the switch
- Member ports can have diffrenet etherchannel status flags
- Want to see SU on the Port-Channel, and P flags on the memeber ports

SW1(config-if-range)#channel-group 1 mode ?
- Show diffrenet EtherChannel modes for the ports.
- Correct modes for the port must be configured to form an etherchannel
- Use active to enable etherncannel

SW1#show etherchannel load-balance
- Shows to load balance method for the etherchannel

SW1(config)#port-channel load-balance ?
- Shows all load-balancing techniques to configure for the whole switch

SW1(config)#port-channel load-balance src-dst-ip
- Sets to load-balance to destinaton IP address

***EtherChannel Notes***
> Groups ports together into a signal interface to increase bandwith and speed

----------------------------------------------------------------------------------------------------
Day 25 - EIGRP

*** Loopbacks ***
R1(config)#interface loopback 0
R1(config-if)#ip address 1.1.1.1 255.255.255.255
- Common to use a 255.255.255.255 mask for loopbacks
- Are often used as the router Id?

***EIGRP***
R1#show ip protocols
R1#show ip eigrp neighbors
R1#show ip route eigrp
R1#show ip route eigrp topology

R1(config-if)#router eigrp 100
- Can config directly from interface
- AS Number must match for two routers to become EIGRP neighbors

R1(config-router)#network 0.0.0.0 255.255.255.255
- Enables EIGRP on all interfaces. Not always recommended.
- Uses a wildcard subnet mask. All ip address are in the 0.0.0.0 range,
so activates on all networks.

R1(config-router)#network 10.0.13.0 0.0.0.3
- Set specfic network to advertise. 
- Wildcard mask 0.0.0.3 is a /30 subnet
R1(config-router)#network 1.1.1.1 0.0.0.0
- Advertise loopbacks as well. 
- Wildcard Mask 0.0.0.0 is a /32 subnet

R1(config-router)#no auto-summary
- Disables auto-summary of networks. Recommended/Necessary

R1(config-router)#passive-interface g0/0
R1(config-router)#passive-interface loopback0
- Configure interfaces that are connected to end hosts as passive
- Prevents to router from wasting resources, and sending EIGRP messages
out of those interfaces
R1(config-router)#passive-interface default

R1(config-router)#variance 2
- Set the variance on EIGRP to allow for uneven loading balancing.

R1(config)#no router eigrp 100
- Deletes EIGRP from the router

R1(config)#router eigrip 100
R1(config-router)#shutdown
- Shutsdown EIGRP

R1#clear ip route *
-Clears all IP routes

*** Notes ***
- EIGRP uses bandwith and delay to calculate metric
- Bandwith of the slowest link + the delay of all links
- Fesible distance = this routers metric value to the routes desitination
- Reported Distance = The neighbors metric value to the routes desitnation
    - Also know as Advertised Distance
    - Administrative Distance is used to compare routes from diffrenet protocols

P 192.168.4.0/24, 1 successor, FD is 28672
    via 10.0.12.2 (28672 - FD/ 28416 - RD), G0/0
    via 10.0.13.2 (30976 - FD/28416 - RD), FA1/0

- 1st number is Fesiable Distance (FD)
- 2nd is Reported Distance (RD)
- Successor = the route with the lowest FD to the desitination (best route)
- Fesible Successor = an alternate route to the desitination. Must meet the feasiblity condition
    - Route is consided Feasible when it's RD < Succesor FD
- FD and RD are essentially a loop prevention mechanism

- Variance 1 = only ECMP load-balancing will be perfromed
    - Load balance won't occur if routes have diffrent FDs
- Increase variance (FD * X) allows of load balancing on routes with higher FD
    - Unequal cost-load balancing only occurs on routes that are Fesiable Succesors
    - Both routes will then appear in the routing table
    - Better routes will still recieve more traffic

----------------------------------------------------------------------------------------------------
Day 26/27/28 - OSPF

R1#show ip protocols
R1#show ip ospf

R1#show ip osfp database
- Shows the Link State database

R1#show ip ospf neighbor
- Shows the routers ospf neighbors

R1#show ip ospf interface gigabitEtherenet0/0/0

R1(config)#no router ospf 1
- Removes OSPF

R1(config-router)#router ospf 1
- Process ID after ospf. Only specific to the router. Other routers
don't care

R1(config-router)#router-id 1.1.1.1
- Usually the ID is a loopback interface

R1# clear ip ospf Process
- Clears the OSPF process to reassign router Id

R1(config-router)#network 0.0.0.0 255.255.255.255 area 0
- Network command to active OSPF on interfaces/networks.
- Smilar to EIGRP. Useses wild card mask
- Area command comes after. Sub divide OSPF networks into areas
for better design.

R1(config-if)#interface GigabitEthernet0/1
R1(config-if)# ip ospf 1 area 0


R1(config-router)#network 10.0.34.1 0.0.0.0 area 0
- Can configure on specific networks and point-to-point connections

R1(config-router)#passive-interface g0/0
- Similar to EIGRP in that edge interfaces with end hosts should be passive
- Applies to loopbacks topolgies
- Prevents router from sending OSPF messages on those interfaces.

R1(config-router)#default-information originate
- Tells the router to advertise a default route
R1(config-router)#ip route 0.0.0.0 0.0.0.0 203.0.113.1

R1(config)#interface range g0/0 - 3
R1(config-if-range)#ip ospf 1 area 0
- Enables ospf on the target interfaces
- Alternative to using the network command

R1(config-router)#auto-cost reference-bandwidth ?
- Shows the cost commands for the ospf router

R1(config-router)#auto-cost reference-bandwidth 10000
- Sets the refernce cost
- Cost = reference-bandwidth/interface-speed
- All routers on the ospf area should have the same refernce speed

***Notes**
OSPF Neighbor Requirements
1) Area number must match
2) Interfaces must be in the same subnet
3) OSPF process must not be shutdown
4) OSFP Router IDs must be unique
5) Hello and Dead timers must match
6) Authentication settings must match
7) IP MTU settings ust match - Can still form neighbors, but malfunctions
8) OSFP Network Type must match - Can still form neighbors, but malfunctions

----------------------------------------------------------------------------------------------------
Day 29 Configuring HSRP
- Hot Standby Router protocols
- Configures a back up router for the network

R1#show standby
- Shows HSRP information

R1(config-if)#standby version 2
- Configures HSRP on the interface with the targer version
- Versions must match or else there will be errors

R1(config-if)#standy ?
- Shows all options
- Good to match the group number with the vlan number
R1(config-if)#standby 1 ip 10.0.1.254
- Sets the Virtual IP Address for the interface
- Both the Master Router and the Backup must have the same VIP

R1(config-if)#standby 1 priority 200
- Customizes the priority for the interface

R1(config-if)#standby 1 preempt
- Enables preemtion 
- Causes the router with the highest priority to take back the Master

C:\>arp -a
- Notice that both the original gateway, and the virtual ip gate way on
end hosts

C:\>tracert 8.8.8.8
- Shows the hops, notice the actual hop ips for the gateways.

----------------------------------------------------------------------------------------------------
Day 31 & 32 Configuring IPv6

R1#show ipv6 interface brief
- shows the status of ipv6 enable interfaces

R1(config-if)#ipv6 address 2001:DB8:0:1::1/64
- Adds an IPv6 address to the interface

R1(config)#ipv6 unicast-routing
- Enables ipv6 routing on the router

R1(config-if)#ipv6 address 2001:DB8::/64 eui-64
- Configures an EUI-64 on an interface

R1(config-if)#ipv6 enable
- Configures a link local address on the interface

R1(config)#ipv6 route 2001:db8:0:1::/64 g0/0 FE80::201:63FF:FEB0:B801 <AD>
- Configure a static route for ipv6
- Must specify the exit interface for link local next hops
- Optional Administrative Distance

----------------------------------------------------------------------------------------------------
Day 34/35 - Standard ACLs/Extended ACLs

- Standard ACLs should be configured as close to the desitination 
as possible
- ACLs implicitly deny all traffic that is not specified.

R1#show access-lists

R1(config-router)#ip access-list standard [NAME]
- NAME is used to refernce access lists. Required? For named lists yes.
R1(config-std-nacl)#permit 172.16.1.1
- Allows access for a single host
R1(config-std-nacl)#deny any
- Denies all hosts besides the one specified
- Not always neede, but provides assurance

R1(config-if)#ip access-group {NUMBER | NAME} out
- Applies the numbered or named access-list to the interface
- The out keyword, filters traffice that is coming OUT of the interface

R1(config-std-nacl)#deny 172.16.2.0 0.0.0.255
- Denies traffice from a particular network
- Uses wildcard mask
- Also needs to be applied to an interface

R1(config-router)#access-list 1 deny 172.16.1.0 0.0.0.255
R1(config-router)#access-list 1 permit any
- Numbered access-lists don't need a name
- No IP keyword
- Remember order of ACLs commands matter

R1(config-if)# interface g0/0
R1(config-if)#ip access-group 1 out
- Also need to be applied to interface

R1(config)#ip access-list resequence number 10 10
- resequence the ACEs inside the numbered ACL
- In this case renmae the first entry to 10, and then add 
10 to every entry after that
- Good for making edits or inserting ACEs into the list

R1(config)# access-list number {permit | deny} protocol src-ip [host] dest-ip
- Creates an extened ACL on a numbered access-list
- src-ip uses a wild card mask.
- dest-ip can be a end host or network with wild card mask
- Classic extened is 100-199
- For extened range 2000-2699
- Still apply it to an interface 



R1(config)# ip access-list extended {name | number}
R1(config-ext-nacl)# [seq-num] {permit | deny} [eq] protocol src-ip [eq] dest-ip
- Creates an extened ACL on named access-list
- { } are required, [ ] are optional
- src-ip = Source IP
- dest-ip = Desitination IP
- protocol = Layer 4 encapsulation type TCP, UDP, IPMI
- [seq-num] = Number of the ACE inside the ACL
- [eq] = Specify the port numbers to deny on src/dest ip


R1(config-if)#ip access-group {NUMBER | NAME} out
- Applies the numbered or named access-list to the interface
- The out keyword, filters traffice that is coming OUT of the interface


R1(config)# no access-list 1 (101 - 199 Extended)
R1(confg)# no ip access-list [EXTENDED] name
- Deletes access lists

****Extra Notes for ACLs*****
- Remember ACLs have an implict deny, and normally need a any ACE

Common Protocls for ACLs
- ip, tcp, udp, icmp, gre, ospf, eigrp..

Common Port Numbers by Protocol
TCP = Transmition Control Protocal (Layer 4)
- FTP Data (20)
- FTP Control(21)
- SSH (22)
- HTTP (80)
- POP3 (110)
- HTTPS (443)

UDP = User Datagram Protocols
- DHCP Server (67)
- DCHP Client (68)
- TFTP (69)
- SNMP agent (161)
- SNMP manager (162)
- Syslog (514)

TCP & UDP
- DNS (53)

----------------------------------------------------------------------------------------------------
Day 36 - CDP & LLDP 

- Layer 2 discovery protocol
- CDP is Cisco propritary, LLDP is industry standard
- CDP Globally enabled by default for Cisco devices and interfaces

- LLDP is default disable on Cisco devices
- Needs to enable globably and on the interface
- Both LLDP and CDP can be enable at the same time
- LLDP Messages are perdoically sent to the
 multicast MAC address 0180.C200.00E. 

-Show commands for CDP
R1#show cdp 
R1#show cdp traffic
R1#show cdp interface
R1#show cdp neighbors
R1#show cdp neighbors detail
R1#show entry name

- Config commands incase you want to modify CDP
R1(config)# [no] cdp run
R1(config)# [no] cdp enable

R1(config)# cdp timer seconds
R1(config)# cdp holdtime seconds
R1(config)# [no] cdp advertise-v2

- LLDP Config Commands
R1(config)# lldp run
- Globally enable lldp

R1(config-if)# lldp transmit
R1(config-if)# lldp receive
- Enables llpd on the interfaces

R1(config)# lldp timer seconds
R1(config)# lldp holdtime seconds
R1(config)# lldp reinit seconds

- LLDP Show Commands
R1# show lldp traffic
R1# show lldp neighbors 
R1# show lldp neighbors details

----------------------------------------------------------------------------------------------------
Day 37 - NTP

- Network Time Protocls
- Devices must have a sync'd clock for proper network function
- Most important reason for engineers is for accurate logs for troubleshooting
- All devices have an internal clock in UTC

- Show commands
R1#show clock
R1#show clock detail
R1#show logging

- Config Commands
R1#clock set {time} {day} {month} {year}
- Manually set the device time
- Configures the software clock

R1#calendar set {time} {day} {month} {year}
- Configures the hardware clock
- Normally you want to sync the clock and calendar

R1#clock update-calendar
- Sycns the calendar to the clock time

R1#clock read-calendar
- syncs the clock to the calendar time.

R1(config)#clock timezone {time-zone name} {hours}
- Names the timezone
- Sets the timezone with hours off from UTC

R1(config)#clock summer-time recurring {week} {day} {month} {time}
- Configures start of recurring day-light savings time
- Enter a second command with similar params for the end time

!Basic Configuration Commands Summary
R1(config)# ntp server ip-address [prefer]
R1(config)# ntp peer ip-address
R1(config)# ntp update-calender
R1(config)# ntp master [stratum]
- Turns the router in a stratum 1 master server
R1(config)# ntp source interface

!Basic Show Commands Summary
R1(config)# show ntp associations
R1(config)# show ntp status

!Basic Authentication Commands
R1(config)# ntp authenticate
R1(config)# ntp authentication-key key-number md5 key
R1(config)# ntp trusted-key key-number
R1(config)# ntp server ip-address key key-number
R1(config)# ntp peer ip-address key key-number

----------------------------------------------------------------------------------------------------
Day 38 - DNS

Windows Commands
>ipconfig /all
>ipconfig /displaydns
>ipconfig /flushdns
>nsloolup

R1(config)#ip dns server
- Configures R1 to be a DNS server

R1(config)#ip host R1 192.168.0.1
- Manually adds hosts and ips to the host table
- Entires are automatically added by DNS when it's 
functioning

R1(config)#ip name-server 8.8.8.8
- Configures a DNS Server that R1 will query 
if the record is not in the host table
- R1 becomes a DNS Client

R1(config)#ip domain lookup
- Eabled by default
- Enable R1 to perform DNS queries

R1(config)#no ip domain lookup
- Disables DNS queries

R1(config)#show hosts
- Shows all records in the host table

----------------------------------------------------------------------------------------------------
Day 39 - DHCP


R1(config)#ip dhcp exclude-address {ipv4-address range}
- Specify a range of addresses that won't be given to DHCP clients

R1(config)#ip dhcp pool {name}
- Create a DHCP pool

R1(dhcp-config)#network {network ipv4 address} {subnet mask or prefix}
- Specify the subnet ofaddresses to be assigned to clients
- Does not assign excluded ips

R1(dhcp-config)#dns-server {ipv4-address}
- Specify the DNS server that DHCP clients should use

R1(dhcp-config)#domain-name {name}
- Specify the domain name of the network
-IE PC1=pc1.yournetworkname.com

R1(dhcp-config)#default-router {ipv4 address of interface}
- Specify the default gateway for that pool of ip addresses

R1(dhcp-config)#lease {days} {hours} {minutes}
- Specify how long the lease lasts untill it
expires/renews

R1(config)#interface g0/1
R1(config-if)#ip helper-address {ipv4 address of the DHCP server}
- Configure the ipv4 address of the DHCP server as 
the 'helper' address
- Routes DHCP requests from the clients to DHCP Server
- Also known as the relay agent
- Configured on the interface connected to the DHCP clients

R1(config-if)#ip address dhcp
- Uses DHCP to assign an address to the interface

- Useful show methods
R1#show ip dhcp pool
R1#show ip dhcp binding
R1#show running-config | include excluded-address
R1#show running-config | section dhcp


- Command line prompts for Windows
C:\>ipconfig /renew
- Gets an ip addres from DHCP

C:\>ipconfig /release
- Releases he IP address from the client back to the pool

C:\>ipconfig /all

----------------------------------------------------------------------------------------------------
Day 42 - SSH

SW1#show version

SW1# show ip SSH

SW1(config)# ip default-gateway {ip-address}

SW1(config)# line con 0

SW1(config)# line vty 0 15

SW1(config)# crypto key generate rsa 

SW1(config)# ip ssh version 2

SW1(config-line)# login [local]

SW1(config-line)# transport input [protocols | all | none]

SW1(config-line)# exec-timeout {minutes} {seconds}

SW1(config-line)# access-class acl in 

SW1(config)# username {name} seceret {password}

C:\>ssh -l admin 192.168.2.253

----------------------------------------------------------------------------------------------------
Day 43 - FTP & TFTP (File Transfer Protocol) & (Trival File Transfer Protocol)

$$$ TFTP Commands $$$

R1(config)# show version

R1(config)# show flash

R1(config)#copy tftp flash
Address or name of remote host?
Source file name?
Destination file name?
<enter>

R1(config)#boot system flash {filename}

R1#write

R1#reload

R1#delete flash:{filename}

$$$ FTP Commands $$$
- Takes much longer the TFTP

R1(config)#ip ftp username {username} {password}

R1(config)#copy ftp flash
Address or name of remote host?
Source file name?
Destination file name?
<enter>

----------------------------------------------------------------------------------------------------
Day 44 - Static NAT

R1# show ip nat translations

R1#show ip nat statistics

R1(config)#int g0/1
R1(config-if)# ip nat outside

R1(config)#int g0/0
R1(config-if)# ip nat inside

R1(config)#ip nat inside source static {inside private ip address} {inside global ip address}
- 1 to 1 translation. Use host ip addresses, not networks

R1# clear ip nat translation *

----------------------------------------------------------------------------------------------------
Day 45 - Dynamic NAT

R1(config)#int g0/1
R1(config-if)# ip nat inside

R1(config)#int g0/0
R1(config-if)# ip nat outside

R1(config)#access-list 1 permit 192.168.0.0 0.0.0.255
- Define the traffic that should be translated
- Traffic permited by this ACL will be translated

R1(config)#ip nat pool POOL1 100.0.0.0 100.0.0.255 prefix-length 24
- Define the pool of inside global IP addresses

R1(config)#ip nat inside source list 1 pool POOl1
- Applies the ACL and the pool to the router

$$$ PAT(Network Address Translation Overload) $$$
- Uses port numbers to translate IP address and persever unique global ips
- ex. 192.168.0.1:54321 --> 100.0.0.1:54321
- ex. 192.168.0.1:54322 --> 100.0.0.1:54322
- The router uses the port numbers to complete the connection
- Roughly the same config commands as regular Dynamic NAT

R1(config)#int g0/1
R1(config-if)# ip nat inside
R1(config)#int g0/0
R1(config-if)# ip nat outside

R1(config)#access-list 1 permit 192.168.0.0 0.0.0.255
- Tells the router which network address to translate
- Always needed

R1(config)#ip nat pool POOL1 100.0.0.0 100.0.0.3 netmask 255.255.255.0
- Unless the network is really large, you probably only need a single inside
global address using PAT. A few extras here for expansion

R1(config)#ip nat inside source list 1 pool POOl1 overload
- Applies the ACL and the pool to the router with overload

R1(config)#ip nat inside source list 1 interface g0/0 overload
- Another method of activing PAT 
- Configure PAT by mapping the ACL to the interface and enable overload
- No need to use the POOL, uses the IP of the nat outside interface